<?php
return [
        'custom' => [
            'email' => [
                'required' => 'حقل الإيمل مطلوب',
                'email' => 'يجب أن يكون البريد الإلكتروني صحيحًا.',
                'unique' => 'الايميل موجود مسبقاً يرجى استخدام ايميل جديد',
            ],
            'password' => [
                'required' => 'حقل الباسوورد مطلوب',
            ],
            'role_name' => [
                'unique' => 'أسم الدور مستخدم من قبل',
            ],
            'mobile_number' => [
                'unique' => 'رقم الجوال مستخدم من قبل',
                'required' => 'رقم الجوال مطلوب',
            ],
            'user_email' => [
                'unique' => 'الايميل موجود مسبقاً يرجى استخدام ايميل جديد',
                'required' => 'حقل الإيمل مطلوب',
            ],
            'permissions' => [
                'required' => 'حقل الصلاحيات مطلوب ',
            ],

        ],
];

